Revit 2024 API
ParameterTypeId.AnalyticalModelSketchProjection Property
 "In-Plane Projection"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId AnalyticalModelSketchProjection { get; }
Visual Basic
Public Shared ReadOnly Property AnalyticalModelSketchProjection As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ AnalyticalModelSketchProjection {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace